# this is ../c/maize/crops/18r/planning/packing_plan.org


** tables

field 34 last in 14R, 279 stakes

#+tblname: planning
| type             | num rows | modified |
|------------------+----------+----------|
| bulks            |       61 |          |
| Les15            |       10 |          |
| lls1*            |       14 |          |
| selves           |       10 |          |
| dominants        |       22 |          |
| recess           |       17 |          |
| elites           |       41 |          |
| balint-kurti     |        0 |          |
| gardner          |        0 |          |
| total non-inbred |      175 |        0 |
| inbred           |          |          |
| total rows       |          |        0 |
#+TBLFM: @11$2=vsum(@2..@10)::@11$3=vsum(@2..@10)::@13$3=vsum(@11..@12)

| balint-kurti     |     13.5 |          |
| gardner          |      2.5 |          |



#+NAME:inbreds
|                                           |      S |     W |    M |    B | total rows by plntg |
|-------------------------------------------+--------+-------+------+------+---------------------|
| over-planting factors                     |    1.5 |   1.5 |    2 |  1.5 |                     |
|-------------------------------------------+--------+-------+------+------+---------------------|
| 1st plntg lines                           |     81 |    70 |   75 |   52 |                     |
| 2nd plntg lines                           |     10 |    10 |   10 |    0 |                     |
|-------------------------------------------+--------+-------+------+------+---------------------|
| 1st plntg ears                            |    243 |   210 |  225 |  156 |                     |
| 2nd plntg ears                            |     30 |    30 |   30 |    0 |                     |
|-------------------------------------------+--------+-------+------+------+---------------------|
| 1st plntg rows, inc losses                | 18.225 | 15.75 | 22.5 | 11.7 |                     |
| 2nd plntg rows, inc losses                |      3 |     3 |    6 |    0 |                     |
| true 1st plntg rows + some 2nd plntg rows |        |       |      |      |                     |
| rows by inbreds, all plantings            |        |       |      |      |                     |
|-------------------------------------------+--------+-------+------+------+---------------------|
| rounded 1st plntg rows                    |     18 |    16 |   22 |   12 |                  68 |
| rounded 3rd plntg rows                    |      3 |     3 |    6 |    0 |                  12 |
| total rounded rows                        |        |       |      |      |                  80 |
#+TBLFM: @5$2=@3$2*3::@5$3=@3$3*3::@5$4=@3$4*3::@5$5=@3$5*3::@6$2=@4$2*3::@6$3=@4$3*3::@6$4=@4$4*3::@6$5=@4$5*3::@7$2=@5$2*@2$2/20::@7$3=@5$3*@2$3/20::@7$4=@5$4*@2$4/20::@7$5=@5$5*@2$5/20::@11$6=vsum($2..$5)::@12$6=vsum($2..$5)::@13$6=vsum(@11..@12)



Half-rows start at 207.

#+NAME:stakes
|-------------------------------------------------+-------|
| full rows elite, interspersed                   |    41 |
| full rows inbreds                               |    80 |
| full rows mutants                               |    84 |
| half rows mutants                               |    97 |
| total stakes                                    |   302 |
| total physical rows needed, exclusive of border | 253.5 |
#+TBLFM: @6$2=vsum(@1..@3) + @4/2




#+BEGIN_SRC example of counting by planting using grep and wc
bash-3.2$ grep '\],1,\[' packing_plan.org | wc
     132    1187   16898
bash-3.2$ grep '\],2,\[' packing_plan.org | wc
     103     561   11729
bash-3.2$ grep '\],3,\[' packing_plan.org | wc
       6       6     462
#+END_SRC



